{"pageProps":{"noteKey":["architecture","DDD","services"],"note":{"title":"DDD Services Differences","date":"2022-05-25","content":"\n<h2>Domain Services</h2>\n<p>\n  <code>Domain services</code> are services, which encapsulate business logic, specific to the bounded context\n  they related to. They include those part of the business logic, which can't be directly included\n  into domain entity.\n  Being a core layer functionality, domain services heavily use domain specific ubiquitous language.\n</p>\n<p>They normally not include any particular use case specific or persistence logic and code, related to interference with external services.</p>\n<p>According to Eric Evans:</p>\n<blockquote>\n  <p>\n    When a significant process or transformation in the domain is not a natural responsibility of an ENTITY or VALUE OBJECT, add an operation to the model as standalone interface declared as a SERVICE.\n    Define the interface in terms of the language of the model and make sure the operation name is part of the UBIQUITOUS LANGUAGE. Make the SERVICE stateless.\n  </p>\n</blockquote>\n<p>\n  It is important to keep track of what logic goes to this services and not overuse it, because\n  it may lead to appearance of anemic domain models with all logic in services and domain entities\n  playing role of simple data structures.\n</p>\n<h2>Application Services</h2>\n<p>\n  <code>Application services</code> include logic, specific only to some particular application use case. Such\n  code normally can't be encapsulated into separate object and can't be reused across application.\n  <code>Application service</code> is an external boundary of application. External layer for them will be e.g.\n  web-framework, console application or any other concrete way to ship our application to the world.\n  Application layer usually has a translation role between external environment and application core. So it also known as interface to the domain.\n</p>\n<h2>Infrastructure Services</h2>\n<p>\n  <code>Infrastructure services</code> used to encapsulate logic, related to external service calls, persistence, connectivity of all kinds, like queues, sending notifications, messages or file system access e.t.c. In other words <code>IO</code> of any kind.\n  Usually on this level there will be placed various anti-corruption services, encapsulating usage of drivers.\n</p>\n<p>Infrastructure layer services should not contain any core business logic. They also usually don't use domain specific ubiquitous language natural for domain services. They have simple concern on low level functionality. And when domain level needs to use this functionality they use infrastructure service through defined interface. So that allows to decouple low level functionality from application core.</p>\n<h2>Resources</h2>\n<ul>\n  <li><a href=\"http://gorodinski.com/blog/2012/04/14/services-in-domain-driven-design-ddd/\">Services in Domain-Driven Design (DDD)</a></li>\n</ul>\n"}},"__N_SSG":true}