{"pageProps":{"noteKey":["linux","netcat"],"note":{"title":"Netcat","date":"2023-03-17","content":"\n<p>\n  In Linux, <code>nc</code> stands for <code>netcat</code>, which is a simple utility used to read from and write to network connections using <code>TCP</code> or\n  <code>UDP</code>. It is a versatile tool that can be used for a variety of network-related tasks, such as debugging and testing network\n  connectivity, sending files across the network, and creating custom network applications.\n</p>\n<p>\n  The <code>nc</code> program provides a command-line interface that allows users to specify various parameters to control the behavior of\n  the tool, such as the type of connection to use, the port number to connect to or listen on, and the data to be sent or received.\n  Here are a few examples of how <code>nc</code> can be used:\n</p>\n<p><strong>Debugging network connectivity:</strong></p>\n<p>\n  The <code>nc</code> program can be used to test network connectivity between two hosts by connecting to a specific port and sending a\n  test message. For example, the command:\n</p>\n<pre><code class=\"hljs language-bash\">nc -vz example.com 80\n</code></pre>\n<p>will attempt to connect to port <code>80</code> on the host <code>example.com</code> and report whether the connection was successful or not.</p>\n<p><strong>Sending files over the network:</strong></p>\n<p>\n  The <code>nc</code> program can be used to transfer files over the network by piping the file contents to the <code>nc</code> command on one end,\n  and receiving the data on the other end using the <code>nc</code> command. For example, to send a file <code>file.txt</code> from one host to another,\n  you can use the command:\n</p>\n<pre><code class=\"hljs language-bash\"><span class=\"hljs-built_in\">cat</span> file.txt | nc -q 5 host2 1234\n</code></pre>\n<p>on the sending end, and</p>\n<pre><code class=\"hljs language-bash\">nc -l -p 1234 > file.txt\n</code></pre>\n<p>on the receiving end.</p>\n<p>\n  Creating custom network applications: The <code>nc</code> program can be used as a building block for custom network applications that\n  need to establish <code>TCP</code> or <code>UDP</code> connections. By using <code>nc</code> in conjunction with other Unix utilities, it is possible to\n  create custom network clients and servers that perform specific tasks.\n</p>\n"}},"__N_SSG":true}