{"pageProps":{"noteKey":["architecture","DDD","anemic-domain-model"],"note":{"title":"Anemic Domain Model","date":"2022-05-24","content":"\n<p>\n  <code>Anemic Domain Model</code> is a such domain model, which contains no or very little of business logic.\n  Usually this appears as domain model in simple type with all open fields and no behavior. In such\n  cases all business logic lives in separate services, which use domain model public fields to get\n  data for it's manipulation.\n</p>\n<p>\n  Main downside of this approach is code duplication. When we have a single domain model and various\n  use case services, which use it and implement business logic tightly related to this model it is\n  inevitably leads to duplication of this logic in different use cases. Than later, when our requirements\n  on this logic will change it may cause issues, because we need to change all places, where this\n  duplicated logic exists. It is highly possible, that we will change not all instances of this logic.\n  This also raises cognitive complexity, because we need to remember <code>n</code> business logic variants in <code>m</code> use cases.\n</p>\n<p>\n  When domain related logic is placed near to the domain entity we reduce duplication and make future\n  changes easier and less error prone. It is always easy to start searching for some business logic in\n  a singe domain entity, than exploring whole bunch of use cases.\n</p>\n<p>\n  This means, that those logic, which is highly related to the business object itself should be placed\n  directly inside this business entity and those logic, which may not be placed into entity, but still\n  related to it, like validation, should be placed inside domain service and not on application layer.\n</p>\n<p>\n  In application layer there should be only logic related to particular use cases, which can't be\n  encapsulated or reused by other services.\n</p>\n<p>\n  And logic related to external resources, like databases, queues, calls to external services, should\n  be placed inside infrastructure layer.\n</p>\n<p>\n  The downside of this separation is of course - implementation time. So it is always good to analyze\n  if benefits of <code>rich domain model</code> worth time spent on it's implementation. In cases, when this is\n  a one-time use application, prototyping, proof of concept it is likely that <code>anemic domain model</code>\n  has it's benefits of fast implementation.\n</p>\n<h2>Resources</h2>\n<ul>\n  <li><a href=\"https://khalilstemmler.com/wiki/anemic-domain-model/\">Anemic Domain Model</a></li>\n</ul>\n"}},"__N_SSG":true}