{"pageProps":{"noteKey":["architecture","design-patterns","state"],"note":{"title":"State Pattern","date":"2022-05-13","content":"\n<p>\n  <code>State</code> object oriented design pattern is useful, when object should frequently change it's behavior\n  depending on it's current state.\n</p>\n<p>At any point in time object may have certain state, which will affect it's behavior. Object can change it's state, but this change have to be valid according to defined transition rules. In other words object defines it's rules for state transitions and validates any state transition. So some state changes may be applied and some rejected.</p>\n<p>\n  Usually these transition is a some kind of <code>Finite State Machine</code>. In simplest solution transition rules are implemented with <code>switch</code> or trees of <code>if/else</code> conditions.\n  When amount of states is big or, when we frequently add new behavior, it is not only becomes hard to manage such code, but there will be much higher chance of an error.\n</p>\n<h2>When To Use</h2>\n<p>\n  <code>State</code> pattern is useful, when object has some set of methods and behavior of these methods should vary depending on a state this object currently has.\n  Important to note that <code>State</code> pattern is applicable, when all of object behavior methods are applicable in all states, but behave differently.\n</p>\n<p>It follows <code>Single Responsibility</code> and <code>Open/Closed</code> principles. When adding new behavior, we need to add new state classes, but not required to change much of existing codebase. When some of the states requirement changes, only particular state logic will be required to be changed not affecting other states.</p>\n<p>\n  But even if applicable, using state may be an over-engineering in simple scenarios with little concrete\n  states amount and when logic depending on this states changes not very often. It is always worth to analyze if using the pattern will solve a problem in a more efficient way, than it is already implemented.\n</p>\n<h2>Implementation</h2>\n<p>\n  Following <code>State</code> design pattern, we need to create new object which will encapsulate general object behavior. This object called <code>context</code>.\n  And create separate objects, which represent each <code>state</code> of parent object. All of the state objects\n  must implement common state interface. It may be particular language construction, like <code>interface</code>\n  in C# and Java or simply have same methods for dynamic languages.\n  <code>Context</code> contains single object of <code>State</code> interface, which represents current object state.\n</p>\n<p><code>Context</code> object should have special method for changing it's state and it will receive <code>state</code> objects.</p>\n<p><code>State</code> methods should be applicable for all possible object state, but their behavior on different states may vary.</p>\n<p>\n  It is allowed for <code>state</code> to have back reference to it's parent <code>context</code>. Such a way state may receive\n  some data from the context.\n</p>\n<h2>References</h2>\n<ul>\n  <li><a href=\"https://refactoring.guru/design-patterns/state\">Refactoring Guru</a></li>\n</ul>\n"}},"__N_SSG":true}