{"pageProps":{"noteKey":["data science","machine learning","k-nearst-neighbors"],"note":{"title":"K-nearest neighbors","date":"2023-08-23","content":"\n<h2>Number Of Neighbors</h2>\n<p>\n  In the k-nearest neighbors (<code>k-NN</code>) algorithm, the parameter <code>k</code> (number of neighbors) denotes how many neighboring data\n  points (or samples) the algorithm should consider when making a prediction for a new, previously unseen data point.\n</p>\n<h3>Classification</h3>\n<p>\n  For a given test point, the algorithm identifies the <code>k</code> training points that are closest to the point. The most frequent\n  class/label among these <code>k</code> training points is then assigned to the test point.\n  For instance, if <code>k = 3</code> and among the three closest training points to the test point, two belong to class <code>A</code> and one belongs\n  to class <code>B</code>, the test point will be classified as class <code>A</code>.\n</p>\n<h3>Regression</h3>\n<p>\n  For a given test point, the algorithm identifies the <code>k</code> training points that are closest to the point.\n  The average of the target values of these <code>k</code> training points is taken, and this average becomes the predicted value for the test point.\n</p>\n<p>Choosing <code>k</code>:</p>\n<ul>\n  <li>\n    <p>\n      A smaller <code>k</code> (e.g., 1 or 3) makes the algorithm more sensitive to noise in the data. It can capture fine detail in the data but can also\n      be more prone to <code>overfitting</code>.\n    </p>\n  </li>\n  <li>\n    <p>\n      A larger <code>k</code> provides more smoothing and can be more resistant to noise in the training data. However, it may also be more\n      prone to <code>underfitting</code>, missing out on finer details.\n    </p>\n  </li>\n</ul>\n<p>\n  Often, the choice of <code>k</code> is validated using techniques like cross-validation to find a value that results in the best predictive\n  performance on unseen data.\n</p>\n<p>Distance Metric:</p>\n<p>\n  The concept of \"nearest\" in <code>k-NN</code> is based on a distance metric, usually <code>Euclidean distance</code>. However, other distance metrics,\n  such as <code>Manhattan distance</code> or <code>Minkowski distance</code>, can also be used. The choice of distance metric can influence which points\n  are considered \"nearest.\"\n</p>\n<h2>Weights</h2>\n<p>\n  <code>weight</code> refers to giving different importance or influence to the neighbors when making a prediction. The idea behind using\n  weights is to give more influence to nearer neighbors than to farther ones. This can sometimes improve the performance of the\n  <code>k-NN</code> algorithm, especially in cases where the nearest neighbors are much more relevant for prediction than the more distant ones.\n</p>\n<p>There are two primary ways in which weights can be used in <code>k-NN</code>:</p>\n<p><strong>Uniform Weights:</strong></p>\n<p>\n  This is the default and the simplest way. Each of the <code>k</code> neighbors has an equal vote in determining the predicted label\n  (in classification) or contributes equally to the average (in regression).\n  In this approach, whether a neighbor is the closest or the <code>kth</code> closest, it gets the same weight.\n</p>\n<p><strong>Distance-Based Weights:</strong></p>\n<p>\n  The weight of each neighbor is inversely proportional to its distance from the test point.\n  For example, a common method is to set the weight of each neighbor as the inverse of its distance. So, if the distance of a\n  neighbor from the test point is <code>d</code>, the weight assigned to this neighbor would be <code>1/d</code>.\n</p>\n<p>\n  In this approach, closer neighbors have a more significant influence on the prediction than those farther away.\n  The choice of using uniform or distance-based weights often depends on the specific problem and dataset. Distance-based\n  weighting can be especially beneficial when the decision boundary is irregular and when closer points are inherently more\n  relevant than those farther away. However, in some cases, uniform weighting might perform just as well or even better. It's\n  typically a good idea to experiment with both and use techniques like cross-validation to determine which approach works better\n  for a given dataset.\n</p>\n"}},"__N_SSG":true}