{"pageProps":{"noteKey":["linux","users_groups_permissions"],"note":{"title":"Linux Rights And Permissions","date":"2022-10-22","content":"\n<h2>Permission Groups</h2>\n<p>Each file and directory has three user based permission groups:</p>\n<ul>\n  <li><code>owner</code> – The Owner permissions apply only the owner of the file or directory, they will not impact the actions of other users.</li>\n  <li><code>group</code> – The Group permissions apply only to the group that has been assigned to the file or directory, they will not effect the actions of other users.</li>\n  <li><code>all users</code> – The All Users permissions apply to all other users on the system, this is the permission group that you want to watch the most.</li>\n</ul>\n<h2>Permission Types</h2>\n<p>Each file or directory has three basic permission types:</p>\n<ul>\n  <li><code>read</code> – The Read permission refers to a user’s capability to read the contents of the file.</li>\n  <li><code>write</code> – The Write permissions refer to a user’s capability to write or modify a file or directory.</li>\n  <li><code>execute</code> – The Execute permission affects a user’s capability to execute a file or view the contents of a directory.</li>\n</ul>\n<p>You can view the permissions by checking the file or directory permissions by reviewing the output of the <code>ls -l</code> command while in the terminal and while working in the directory which contains the file or folder.</p>\n<p>The permission in the command line is displayed as: <code>_rwxrwxrwx 1 owner:group</code></p>\n<p><strong>User rights/Permissions:</strong></p>\n<ul>\n  <li>The first character that marked with an underscore is the special permission flag that can vary.</li>\n  <li>The following set of three characters (<code>rwx</code>) is for the <code>owner</code> permissions.</li>\n  <li>The second set of three characters (<code>rwx</code>) is for the <code>Group</code> permissions.</li>\n  <li>The third set of three characters (<code>rwx</code>) is for the <code>All Users</code> permissions.</li>\n  <li>Following that grouping since the <code>integer/number</code> displays the number of <code>hardlinks</code> to the file.</li>\n  <li>The last piece is the <code>Owner</code> and <code>Group</code> assignment formatted as <code>Owner:Group</code>.</li>\n</ul>\n<h2>Explicitly Defining Permissions</h2>\n<p>To explicitly define permissions you will need to reference the <code>Permission Group</code> and <code>Permission Types</code>.</p>\n<p>The <code>Permission Groups</code> used are:</p>\n<p>\n  <code>u</code> – Owner\n  <code>g</code> – Group\n  <code>o</code> – Others\n  <code>a</code> – All users\n</p>\n<p>The potential Assignment Operators are <code>+</code> (plus) and <code>–</code> (minus); these are used to tell the system whether to add or remove the specific permissions.</p>\n<p>The <code>Permission Types</code> that are used are:</p>\n<p>\n  <code>r</code> – Read\n  <code>w</code> – Write\n  <code>x</code> – Execute\n</p>\n<p>So for an example, lets say I have a file named <code>file1</code> that currently has the permissions set to <code>_rw_rw_rw</code>, which means that the owner, group and all users have read and write permission. Now we want to remove the <code>read</code> and <code>write</code> permissions from the <code>all users</code> group.</p>\n<p>\n  To make this modification you would invoke the command: <code>chmod a-rw file1</code>\n  To add the permissions above you would invoke the command: <code>chmod a+rw file1</code>\n</p>\n<p>As you can see, if you want to grant those permissions you would change the <code>minus</code> character to a <code>plus</code> to add those permissions.</p>\n<h3>Using Binary References To Set Permissions</h3>\n<p>A sample permission string would be <code>chmod 640 file1</code>, which means that the <code>owner</code> has <code>read</code> and <code>write</code> permissions, the <code>group</code> has <code>read</code> permissions, and <code>all other</code> user have no rights to the file.</p>\n<p>The first number represents the <code>Owner</code> permission; the second represents the <code>Group</code> permissions; and the last number represents the permissions for <code>all other</code> users. The numbers are a binary representation of the <code>rwx</code> string.</p>\n<ul>\n  <li><code>r</code> = 4</li>\n  <li><code>w</code> = 2</li>\n  <li><code>x</code> = 1</li>\n</ul>\n<p>You add the numbers to get the <code>integer/number</code> representing the permissions you wish to set. You will need to include the binary permissions for each of the three permission groups.</p>\n<p>So to set a file to permissions on <code>file1</code> to <code>read</code> <code>_rwxr_____</code>, you would enter <code>chmod 740 file1</code>.</p>\n<h2>Owners and Groups</h2>\n<p>I have made several references to <code>Owners</code> and <code>Groups</code> above, but have not yet told you how to assign or change the Owner and Group assigned to a file or directory.</p>\n<p>You use the <code>chown</code> command to change <code>owner</code> and <code>group</code> assignments, the syntax is <code>chown owner:group filename</code>, so to change the owner of <code>file1</code> to <code>user1</code> and the <code>group</code> to <code>family</code> you would enter <code>chown user1:family file1</code>.</p>\n<h2>Advanced Permissions</h2>\n<p>The special permissions flag can be marked with any of the following:</p>\n<p>\n  <code>_</code> – no special permissions\n  <code>d</code> – directory\n  <code>l</code>– The file or directory is a symbolic link\n  <code>s</code> – This indicated the <code>setuid/setgid</code> permissions. This is not set displayed in the special permission part of the permissions display, but is represented as a <code>s</code> in the read portion of the <code>owner</code> or <code>group</code> permissions.\n  <code>t</code> – This indicates the sticky bit permissions. This is not set displayed in the special permission part of the permissions display, but is represented as a <code>t</code> in the executable portion of the all users permissions\n  <code>Setuid/Setgid Special Permissions</code>\n</p>\n<p>The <code>setuid/setguid</code> permissions are used to tell the system to run an executable as the <code>owner</code> with the <code>owner’s</code> permissions.</p>\n<p>Be careful using <code>setuid/setgid</code> bits in permissions. If you incorrectly assign permissions to a file owned by <code>root</code> with the <code>setuid/setgid</code> bit set, then you can open your system to intrusion.</p>\n<p>You can only assign the <code>setuid/setgid</code> bit by explicitly defining permissions. The character for the <code>setuid/setguid</code> bit is <code>s</code>.</p>\n<p>So do set the <code>setuid/setguid</code> bit on <code>file2.sh</code> you would issue the command <code>chmod g+s file2.sh</code>.</p>\n<h2>Sticky Bit Special Permissions</h2>\n<p>The sticky bit can be very useful in shared environment because when it has been assigned to the permissions on a directory it sets it so only file owner can rename or delete the said file.</p>\n<p>You can only assign the <code>sticky bit</code> by explicitly defining permissions. The character for the sticky bit is <code>t</code>.</p>\n<p>To set the <code>sticky bit</code> on a directory named <code>dir1</code> you would issue the command <code>chmod +t dir1</code>.</p>\n<h2>When Permissions Are Important</h2>\n<ul>\n  <li>\n    <p><code>Home directories</code> – The users’ home directories are important because you do not want other users to be able to view and modify the files in another user’s documents of desktop. To remedy this you will want the directory to have the <code>drwx______ (700)</code> permissions, so lets say we want to enforce the correct permissions on the user user1’s home directory that can be done by issuing the command <code>chmod 700 /home/user1</code>.</p>\n  </li>\n  <li>\n    <p><code>Bootloader</code> configuration files – If you decide to implement password to boot specific operating systems then you will want to remove read and write permissions from the configuration file from all users but root. To do you can change the permissions of the file to <code>700</code>.</p>\n  </li>\n  <li>\n    <p>\n      <code>system</code> and <code>daemon</code> configuration files – It is very important to restrict rights to <code>system</code> and <code>daemon</code> configuration files to restrict users from editing the contents, it may not be advisable to restrict read permissions, but restricting write permissions is a must. In these cases it may be best to modify the rights to <code>644</code>.\n      firewall scripts – It may not always be necessary to block all users from reading the firewall file, but it is advisable to restrict the users from writing to the file. In this case the firewall script is run by the root user automatically on boot, so all other users need no rights, so you can assign the <code>700</code> permissions.\n    </p>\n  </li>\n</ul>\n<h2>Groups</h2>\n<p>List all existing groups:</p>\n<pre><code class=\"hljs language-bash\"><span class=\"hljs-built_in\">groups</span>\n</code></pre>\n<p>List groups of specified user:</p>\n<pre><code class=\"hljs language-bash\"><span class=\"hljs-built_in\">groups</span> <span class=\"hljs-variable\">$USER</span>\n</code></pre>\n<p>Get users of specified group:</p>\n<pre><code class=\"hljs language-bash\">getent group &#x3C;group>\n</code></pre>\n<p>To create new group:</p>\n<pre><code class=\"hljs language-bash\">groupadd [options] &#x3C;group name>\n</code></pre>\n<p>To add user into a group:</p>\n<pre><code class=\"hljs language-bash\">sudo usermod -a -G &#x3C;groupname> &#x3C;username>\n</code></pre>\n<h2>Ownership</h2>\n<p>To change file or folder ownership used <code>chown</code> command.</p>\n<pre><code class=\"hljs language-bash\"><span class=\"hljs-built_in\">chown</span> &#x3C;user>:&#x3C;group> &#x3C;file[s]>\n</code></pre>\n<p>To give ownership to a group and not a specific user:</p>\n<pre><code class=\"hljs language-bash\"><span class=\"hljs-built_in\">chown</span> :&#x3C;group> &#x3C;file[s]>\n</code></pre>\n<p>To give ownership recursively to all nested folders and files use flat <code>-R</code></p>\n"}},"__N_SSG":true}