{"pageProps":{"noteKey":["architecture","onion-acrhitecture"],"note":{"title":"Onion Architecture","date":"2022-05-26","content":"\n<h2>Description</h2>\n<p>\n  Coupling is a common software development problem. It reduces ability to maintain and change system\n  following changed requirements. While coupling is a fundamental problem, it is not possible to eliminate it in the software system. But it is possible to reduce coupling by eliminating those kinds of it, which does not bring any advantages. Necessary coupling is directed from less important and frequently changed components to the most valuable and stable components which contain main value of application.\n</p>\n<p>Usually application can be divided to core business logic, which is responsible for solving real world problems, saving time, money. Sometimes it is easy to recognise this logic by the fact, that it may be not automated with computer systems and implemented in other way. Like accountant may calculate balance with or without computer. Computer system just makes this faster and easier.</p>\n<p>The second part is other logic, which is required for core business functionality to exist. It connects business to the outer world with APIs, databases, sends messages or provides access to the file system. This layer also known as <code>infrastructure</code>. Saying differently infrastructure functionality is such code, that is required for application to operate, but does not provide any competitieve advantages for it.</p>\n<p>\n  It is very likely that infrastructure layer functionality changes more often, than core business. We can\n  change databases, messaging systems, we even can deside to change architecture and replace file system calls with third party provided database products, change native application to be web based e.t.c. In all such cases core business not changes. But if we couple out business to infrastructre, making such\n  changes will be hard if in some cases even possible. Such a way we can make changes to the system with less pain. Inversion of dependencies also makes application framework agnostic. All framework, database, connectivity and other not core logic becomes just a plugin for our core domain.\n</p>\n<p>Domain models and business functionality in the center. Other layers are surround core. Dependencies are directed towards the center. Amount of layes may vary. But the principle, when of dependencies is always the same.</p>\n<p>The typical layer structure consists of 4 layers:</p>\n<ul>\n  <li><code>Domain</code>: business objects</li>\n  <li><code>Application</code>: usecases and concrete interface to business</li>\n  <li><code>Infrastructure</code>: databases, external service connectivity, file system...</li>\n  <li><code>UI</code>: frameworks, web, CLI or other ways to use application</li>\n</ul>\n<p>\n  <img src=\"/_images/onion-arch-diagram.png\" alt=\"onion architecture diagram\">\n</p>\n<p>\n  Layers are coupled only with interfaces. For this purpose each inner level defines an interface for\n  the external layer and external layer implements this interface. Later on app configuration this implementations are injected and inner level can use them through the interface. This configuration usually happend on the highest level of the application.\n</p>\n<p>That said onion architecture heavily relied on <code>SOLID</code> <code>Inversion of controle</code> principle.</p>\n<p>\n  Important to note: normally it is a good practice to make path from external layer to the objects it uses as short as possible. In other words best case scenario when layer uses object internal to it, then it can use objects from immediate neibhour(it will always be closest internal layer). Then second neibhour and deeper. Better to avoid last case. For example controller should not access business\n  entities or repositories directly. But onion architecture allows all scenarios until dependencies directed towards center.\n</p>\n<h2>Pros</h2>\n<ul>\n  <li>It allows to reduce unnecessary coupling(business, infrastructure, UI, e.t.c.)</li>\n  <li>Eases maintenence and growth of the system</li>\n  <li>Core layers can be shipped independently from infrastructure and changing infrastructure does not affect core.</li>\n</ul>\n<h2>Cons</h2>\n<ul>\n  <li>Tied to OOP</li>\n</ul>\n<h2>Application Usecases</h2>\n<h2>Refernces</h2>\n<ul>\n  <li><a href=\"https://jeffreypalermo.com/2008/07/the-onion-architecture-part-1/\">The Onion Architecture : part 1</a></li>\n  <li><a href=\"https://jeffreypalermo.com/2008/07/the-onion-architecture-part-2/\">The Onion Architecture : part 2</a></li>\n  <li><a href=\"https://docs.microsoft.com/en-us/archive/msdn-magazine/2009/february/best-practice-an-introduction-to-domain-driven-design\">Best Practice - An Introduction To Domain-Driven Design</a></li>\n</ul>\n"}},"__N_SSG":true}