{"pageProps":{"noteKey":["data science","machine learning","regression"],"note":{"title":"Regression In Machine Learning","date":"2023-08-16","content":"\n<p>Regression models <code>linear</code> and <code>non-linear</code> are used for predicting a real unknown values by set of known similar values.</p>\n<h2>Types Of Regression Models</h2>\n<ul>\n  <li>Simple Linear Regression</li>\n</ul>\n<p>Ordinary list squares - is a method allowing to find best linear regression approximation between all other possible.</p>\n<ul>\n  <li>Multiple Linear Regression</li>\n  <li>Polynomial Regression</li>\n  <li>Support Vector for Regression (SVR)</li>\n  <li>Decision Tree Regression</li>\n  <li>Random Forest Regression</li>\n</ul>\n<h2>Assumptions Of Linear Regression</h2>\n<p>\n  Linear regression fit not every scenario. Before applying it, need to test some assumptions on our data set, which will allow\n  to understand if it is suitable.\n</p>\n<ul>\n  <li>There should be approximate linear relation between dependent and independent parameters.</li>\n  <li>Homoscedasticity - there should not be a cone shape of dataset distribution</li>\n  <li>There should be a normal distribution of our dataset</li>\n  <li>\n    Independence of dataset. Which means that each value in our dataset does not depend on any characteristic of other values\n    in this dataset\n  </li>\n  <li>Coefficients should not correlate to each other</li>\n  <li>Absence of outliers</li>\n</ul>\n<h2>Categorical Data</h2>\n<p>\n  To represent categorical data each discreet value of category split into separate coefficient with value 1 if it is a value of\n  this category and 0 otherwise.\n</p>\n<p>\n  <strong>Dummy variable trap</strong> - important to note that there should be always n-1 coefficient if there is n discreet values of\n  categorical value. Otherwise model will work unreliably.\n</p>\n<h2>Logistic Regression</h2>\n<p>\n  Allows to predict categorical values. Usually <code>yes</code> or <code>no</code> and their likelihood. For example predict whether customer with\n  given characteristics will buy or not.\n</p>\n"}},"__N_SSG":true}